embeddedci-com/benchpod-firmware/stm32h563/src/net_server.c
/*
 * net_server.c — LwIP (NO_SYS=1) bring-up + the JSON/SCPI TCP command server.
 *
 * Replaces the RP2350 ESP32-AT path: the wired RMII interface comes up via DHCP,
 * and a TCP server on port 8080 hands each connection's bytes to the hw worker
 * task (hw_worker_submit_bytes) — command_handler now runs THERE, not here, so a
 * long command can't stall lwIP.  This file runs entirely on the net task and
 * owns lwIP exclusively (NO_SYS=1 is single-threaded): it drains the worker's
 * per-connection conn_tx reply rings into lwIP (net_tx_drain) and applies the
 * worker's close / Nagle requests.  The at_*() transmit seam (used by
 * command_handler.c / scpi_server.c ON THE WORKER) writes into those rings rather
 * than touching lwIP directly.
 */
#include "net_server.h"
#include "ethernetif.h"
#include "command_handler.h"
#include "at_driver.h"
#include "wifi_manager.h"
#include "console_io.h"
#include "cloud_client.h"
#include "mbedtls_port.h"
#include "esp_hosted_spi.h"
#include "net_dhcp.h"
#include "net_route.h"
#include "esp_netif.h"
#include "esp_wifi_ctrl.h"
#include "conn_tx.h"
#include "hw_worker.h"
#include "bp_limits.h"

#include "lwip/init.h"
#include "lwip/netif.h"
#include "lwip/tcp.h"
#include "lwip/timeouts.h"
#include "lwip/dhcp.h"
#include "lwip/apps/mdns.h"
#include "netif/ethernet.h"

#include "FreeRTOS.h"
#include "task.h"        /* vTaskDelay — rare backstop in srv_recv's bulk path */

/* srv_recv accepts each inbound pbuf all-or-nothing into the hw_worker queue, so
   the queue must be able to hold a full lwIP receive window once drained — else a
   maximum-size pbuf could never fit and the connection would stall.  Pin it. */
_Static_assert((size_t)HW_WORK_QUEUE_DEPTH * (size_t)HW_WORK_DATA_MAX >= TCP_WND,
               "hw_worker queue smaller than TCP_WND — srv_recv could deadlock");

#include "device_identity.h"
#include "b64url.h"

#include "stm32h5xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdint.h>

#define TCP_SERVER_PORT   8080
#define NET_MAX_CONN      5            /* TCP conn ids 0..4 (CH_CONSOLE_CONN = 5) */

static struct tcp_pcb *conn_pcb[NET_MAX_CONN];

/* ---- worker -> net requests (the worker task can't touch lwIP) ------------
   The hw worker executes commands and produces replies into the conn_tx rings,
   but the transport-control actions it triggers (close a socket, toggle Nagle)
   touch the lwIP pcb, which only the net task may do.  The worker flags them here
   and the net task applies them in net_poll(). */
static volatile uint8_t s_close_req[NET_MAX_CONN];    /* worker asked to close    */
static volatile int8_t  s_nodelay_req[NET_MAX_CONN];  /* -1 none, 0/1 desired     */

/* ---- multihoming: one LwIP, two netifs (Ethernet always + Wi-Fi via the
   ESP32-C3). Ethernet is preferred; Wi-Fi is a fallback used only when it is
   configured + associated and the wired link is down. The ESP32 is held in
   reset until Wi-Fi credentials are provisioned (see esp_wifi_ctrl). --------- */
/* dhcp_process() runs on a ~500 ms cadence (see net_poll), so this is ~20 s: if
   a lease hasn't arrived by then we re-kick DISCOVER (resets lwIP's backoff to a
   fast 2/4/8 s cadence) rather than letting it drift out to the 60 s cap. Keeps
   reconnection snappy after a slow home router finishes rebooting. lwIP does its
   own retransmission on the fine timer; this is just a coarse backstop. */
#define DHCP_REKICK_TICKS  40

typedef struct {
    struct netif     netif;
    net_dhcp_t       dhcp;          /* pure acquire/retry state machine (net_dhcp.c) */
    uint32_t         dhcp_timer;
    uint8_t          dhcp_fails;    /* consecutive DISCOVER re-kicks with no lease */
    char             ip[16];
    bool             is_eth;        /* wired vs Wi-Fi (log tag / route priority) */
} net_if_t;

static net_if_t s_eth  = { .ip = "0.0.0.0", .is_eth = true  };
static net_if_t s_wifi = { .ip = "0.0.0.0", .is_eth = false };
static bool     s_wifi_static;   /* wifi-static console test: skip DHCP on wifi */
static uint32_t link_timer;

/* After this many consecutive re-kicks (~DHCP_REKICK_TICKS each) with no lease,
   the wired link is presumed wedged (bad autoneg/PLL, not just a slow router) and
   we escalate from "re-send DISCOVER" to a full PHY soft reset. 3 * ~20 s ≈ 60 s
   before the first deep recovery. This is what lets a boot that missed its lease
   self-heal instead of printing "still no lease" forever. */
#define DHCP_ESCALATE_REKICKS  3

/* Ethernet admin control (from the `eth` console/JSON command or the DHCP
   self-heal). Touching HAL_ETH + lwIP must happen on the net task, so other tasks
   only latch a request here; net_poll() applies it. */
typedef enum { ETH_REQ_NONE = 0, ETH_REQ_DOWN, ETH_REQ_UP, ETH_REQ_RESTART, ETH_REQ_SPEED,
               ETH_REQ_REFCLK } eth_req_t;
static volatile eth_req_t s_eth_req;

/* Wired-link diagnostics (eth_diag.h): refreshed every 2 s on this task, logged when an error
   counter moves, printed with every "no lease" line, and read by `eth stats`. */
#define ETH_DIAG_PERIOD_MS    2000u
#define ETH_DIAG_LOG_GAP_MS  10000u
static eth_diag_t s_eth_diag, s_eth_diag_logged;
static uint32_t   s_eth_diag_timer, s_eth_err_log_ms;
static bool       s_eth_diag_primed, s_eth_pool_stall_logged;

static void eth_diag_print(void)
{
    char line[384];
    eth_diag_format(&s_eth_diag, line, sizeof(line));
    printf("[net] eth diag: %s\r\n", line);
}

static void eth_diag_poll(struct netif *netif, uint32_t now)
{
    if (now - s_eth_diag_timer < ETH_DIAG_PERIOD_MS) return;
    s_eth_diag_timer = now;
    bool was_stuck = s_eth_diag.rx_alloc_stuck;
    ethernetif_diag_refresh(netif, &s_eth_diag);
    if (!s_eth_diag_primed) {
        s_eth_diag_logged = s_eth_diag;
        s_eth_diag_primed = true;
        return;
    }
    char delta[160];
    if (eth_diag_error_delta(&s_eth_diag_logged, &s_eth_diag, delta, sizeof(delta)) > 0 &&
        now - s_eth_err_log_ms >= ETH_DIAG_LOG_GAP_MS) {
        s_eth_err_log_ms = now;
        s_eth_diag_logged = s_eth_diag;
        printf("[net] eth errors: %s (phy %s, mac %s)\r\n", delta,
               eth_diag_phy_mode(s_eth_diag.physcsr), eth_diag_mac_mode(s_eth_diag.maccr));
    }
    if (was_stuck && s_eth_diag.rx_alloc_stuck && !s_eth_pool_stall_logged) {
        s_eth_pool_stall_logged = true;
        printf("[net] eth receive stalled: RX buffer pool empty for over %u ms\r\n",
               (unsigned)ETH_DIAG_PERIOD_MS);
    } else if (!s_eth_diag.rx_alloc_stuck) {
        s_eth_pool_stall_logged = false;
    }
}

void net_eth_diag(eth_diag_t *out) { *out = s_eth_diag; }
static bool               s_eth_admin_down;  /* held down by an explicit `eth stop` */
static int                s_eth_force_mbit;  /* `eth speed`: 0 = autoneg, else 10 or 100 */
static int                s_eth_force_full;  /* `eth speed`: duplex when forced */
/* `eth refclk` result: the net task measures, the caller polls net_eth_refclk_result().
   seq increments on every completed measurement so a caller can tell a fresh one from
   the previous answer. */
static volatile uint32_t  s_eth_refclk_seq;
static volatile uint32_t  s_eth_refclk_hz;

