embeddedci-com/benchpod-firmware/stm32h563/src/net_server.c
struct netif *net_route_src_hook(const ip4_addr_t *src, const ip4_addr_t *dest)
{
    struct netif *order[2] = { &s_eth.netif, &s_wifi.netif };   /* priority */
    net_route_if_t ifs[2];
    route_if_fill(&ifs[0], order[0]);
    route_if_fill(&ifs[1], order[1]);
    int i = net_route_pick(ifs, 2, src ? ip4_addr_get_u32(src) : 0, ip4_addr_get_u32(dest));
    return (i < 0) ? NULL : order[i];
}

/* Clear the wired netif's address + DHCP state so acquisition restarts clean. */
static void eth_reset_addr_state(void)
{
    dhcp_stop(&s_eth.netif);
    ip_addr_set_zero_ip4(&s_eth.netif.ip_addr);
    ip_addr_set_zero_ip4(&s_eth.netif.netmask);
    ip_addr_set_zero_ip4(&s_eth.netif.gw);
    s_eth.dhcp.state   = NET_DHCP_OFF;   /* dhcp_process re-DISCOVERs when the link is up */
    s_eth.dhcp.wait_ticks = 0;
    s_eth.dhcp_fails   = 0;
    strcpy(s_eth.ip, "0.0.0.0");
}

/* Apply a latched `eth` stop/start/restart request. Runs on the net task only
   (net_poll), so it can touch HAL_ETH + lwIP directly. */
static void net_eth_apply_request(void)
{
    eth_req_t req = s_eth_req;
    if (req == ETH_REQ_NONE) return;
    s_eth_req = ETH_REQ_NONE;

    switch (req) {
    case ETH_REQ_DOWN:
        s_eth_admin_down = true;
        ethernetif_stop(&s_eth.netif);
        eth_reset_addr_state();
        update_default_route();          /* fail over to Wi-Fi if it's up */
        printf("[net] eth: stopped (admin down)\r\n");
        break;
    case ETH_REQ_SPEED:
        s_eth_admin_down = false;
        eth_reset_addr_state();
        if (ethernetif_force_speed(&s_eth.netif, s_eth_force_mbit, s_eth_force_full) != 0) {
            printf("[net] eth: forcing the link mode failed (MDIO write)\r\n");
            break;
        }
        if (s_eth_force_mbit == 0) {
            printf("[net] eth: autonegotiation restored, re-acquiring link + DHCP\r\n");
        } else {
            printf("[net] eth: link forced to %d M %s, re-acquiring link + DHCP%s\r\n",
                   s_eth_force_mbit, s_eth_force_full ? "full" : "half",
                   s_eth_force_full ? " (a switch port that autonegotiates falls back to HALF:"
                                      " expect a duplex mismatch)" : "");
        }
        break;
    case ETH_REQ_REFCLK: {
        uint32_t hz = 0;
        s_eth_admin_down = false;
        eth_reset_addr_state();
        (void)ethernetif_measure_refclk(&s_eth.netif, &hz);
        s_eth_refclk_hz = hz;
        s_eth_refclk_seq++;
        if (hz == 0) {
            printf("[net] eth refclk: no edges on PA1 — the PHY is not driving the RMII clock\r\n");
        } else {
            long ppm = ((long long)hz - 50000000LL) * 1000000LL / 50000000LL;
            printf("[net] eth refclk: %lu Hz (%+ld ppm vs 50 MHz, measured against the MCU crystal)\r\n",
                   (unsigned long)hz, ppm);
        }
        break;
    }
    case ETH_REQ_UP:
    case ETH_REQ_RESTART:
        s_eth_admin_down = false;
        eth_reset_addr_state();
        ethernetif_phy_restart(&s_eth.netif);   /* link re-negotiates; check_state re-ups */
        printf("[net] eth: %s — PHY reset, re-acquiring link + DHCP\r\n",
               req == ETH_REQ_UP ? "started" : "restarted");
        break;
    default:
        break;
    }
}

/* Public control seam (see net_server.h). Callable from any task — these only
   latch a request; net_poll() applies it on the net task. */
void net_eth_stop(void)    { s_eth_req = ETH_REQ_DOWN; }
void net_eth_start(void)   { s_eth_req = ETH_REQ_UP; }
void net_eth_restart(void) { s_eth_req = ETH_REQ_RESTART; }
/* Ask for a reference-clock measurement, then poll net_eth_refclk_result(): it returns
   true once seq has moved past the value captured before the request. */
void net_eth_refclk_measure(void) { s_eth_req = ETH_REQ_REFCLK; }
uint32_t net_eth_refclk_seq(void) { return s_eth_refclk_seq; }
bool net_eth_refclk_result(uint32_t since_seq, uint32_t *hz_out)
{
    if (s_eth_refclk_seq == since_seq) return false;
    if (hz_out) *hz_out = s_eth_refclk_hz;
    return true;
}

void net_eth_force_speed(int mbit, int full)
{
    s_eth_force_mbit = mbit;
    s_eth_force_full = full;
    s_eth_req = ETH_REQ_SPEED;
}

/* ---- mDNS / DNS-SD responder ------------------------------------------------
   Advertises the pod as "_benchpod._tcp" so a client can browse the LAN and
   enumerate every pod at once (one PTR -> N instances, each with its own A
   record + TXT). The hostname and DNS-SD instance name are made unique from a
   slice of the device's Ed25519 public key, and the full public key travels in
   the TXT record as the stable, collision-proof identifier. The same hostname
   is registered on both netifs, so a multihomed pod shows up once and resolves
   to whichever interface answered. ---------------------------------------- */
static char s_mdns_host[24];   /* "benchpod-a1b2c3"               */
static char s_mdns_inst[32];   /* "BenchPod a1b2c3" (instance)    */
static char s_mdns_id[B64URL_ENCODED_LEN(DEVICE_ID_PUBLIC_LEN) + 1]; /* full pubkey */

static void mdns_build_identity(void)
{
    if (s_mdns_host[0]) return;                 /* build once */
    uint8_t pub[DEVICE_ID_PUBLIC_LEN] = {0};
    device_identity_get_public(pub);            /* leaves zeros if id not ready */

    /* 3-byte slice -> 6 hex chars: a 16M-instance space, ample for a bench LAN. */
    snprintf(s_mdns_host, sizeof(s_mdns_host), "benchpod-%02x%02x%02x",
             pub[0], pub[1], pub[2]);
    snprintf(s_mdns_inst, sizeof(s_mdns_inst), "BenchPod %02x%02x%02x",
             pub[0], pub[1], pub[2]);
    b64url_encode(pub, sizeof(pub), s_mdns_id, sizeof(s_mdns_id));
}

/* TXT builder: clients read these to tell pods apart without connecting. */
static void mdns_txt(struct mdns_service *svc, void *arg)
{
    (void)arg;
    char kv[B64URL_ENCODED_LEN(DEVICE_ID_PUBLIC_LEN) + 8];
    int n;
    n = snprintf(kv, sizeof(kv), "id=%s",   s_mdns_id);       mdns_resp_add_service_txtitem(svc, kv, n);
    n = snprintf(kv, sizeof(kv), "host=%s", s_mdns_host);     mdns_resp_add_service_txtitem(svc, kv, n);
    n = snprintf(kv, sizeof(kv), "port=%d", TCP_SERVER_PORT); mdns_resp_add_service_txtitem(svc, kv, n);
}

static void mdns_register(struct netif *netif)
{
    mdns_build_identity();
    if (mdns_resp_add_netif(netif, s_mdns_host) != ERR_OK) return;
    mdns_resp_add_service(netif, s_mdns_inst, "_benchpod", DNSSD_PROTO_TCP,
                          TCP_SERVER_PORT, mdns_txt, NULL);
}

/* ---- public API -------------------------------------------------------- */
void net_init(void)
{
    ip_addr_t zero;
    ip_addr_set_zero_ip4(&zero);

    for (int i = 0; i < NET_MAX_CONN; i++) s_nodelay_req[i] = -1;   /* -1 = no pending toggle */

    /* Route mbedTLS allocation to the FreeRTOS heap before any TLS work (the
       outbound WSS cloud client uses it). */
    mbedtls_port_init();

    lwip_init();
    mdns_resp_init();

    /* Ethernet netif (always present, default route). dhcp_process() polls the
       link every tick (netif_is_link_up), so no link-change callback is wired. */
    netif_add(&s_eth.netif, &zero, &zero, &zero, NULL, &ethernetif_init, &ethernet_input);
    /* The ETH MAC inserts IP/UDP/TCP checksums in hardware, so leave those OFF in
       software (netif_add defaults to ENABLE_ALL — computing them in software too
       would clash with the MAC's pseudo-header insertion and corrupt UDP/TCP).
       ICMP stays software. The Wi-Fi netif (no HW) enables all — see esp_netif.c. */
    NETIF_SET_CHECKSUM_CTRL(&s_eth.netif,
        NETIF_CHECKSUM_ENABLE_ALL & ~(NETIF_CHECKSUM_GEN_IP |
                                      NETIF_CHECKSUM_GEN_UDP |
                                      NETIF_CHECKSUM_GEN_TCP));
    netif_set_default(&s_eth.netif);
    mdns_register(&s_eth.netif);

