embeddedci-com/benchpod-firmware/stm32h563/src/net_server.c
    /* Wi-Fi netif over the ESP32-C3. The netif is registered (inert until the
       link comes up); the co-processor itself stays in reset until Wi-Fi is
       provisioned, gated inside esp_wifi_ctrl. */
    esp_hosted_spi_init();
    netif_add(&s_wifi.netif, &zero, &zero, &zero, NULL, &esp_netif_init, &ethernet_input);
    mdns_register(&s_wifi.netif);
    /* netif_add() prepends, leaving Wi-Fi first in netif_list. Put eth back in
       front so lwIP's own subnet scan (ICMP errors, anything that bypasses the
       route hook) also prefers the wire. */
    if (netif_list == &s_wifi.netif && s_wifi.netif.next == &s_eth.netif) {
        s_wifi.netif.next = s_eth.netif.next;
        s_eth.netif.next  = &s_wifi.netif;
        netif_list        = &s_eth.netif;
    }
    esp_wifi_ctrl_init();

    server_start();
    cloud_client_init();   /* outbound WSS control channel (if provisioned) */
    printf("[net] LwIP up — eth(RMII/LAN8742) + wifi(ESP32-C3), TCP server on :%d\r\n",
           TCP_SERVER_PORT);
}

void net_poll(void)
{
    ethernetif_input(&s_eth.netif);
    esp_hosted_spi_poll();           /* pump the Wi-Fi SPI transport (RX/TX)   */
    sys_check_timeouts();

    /* The net task owns lwIP; it no longer runs command_handler (that moved to
       the hw worker).  It drives the WS/Wi-Fi transport, then moves the worker's
       queued replies into lwIP and applies the worker's close/nodelay requests. */
    cloud_client_poll();             /* drive the outbound WSS control channel */
    esp_wifi_ctrl_poll();            /* drive Wi-Fi association (if configured) */
    net_tx_drain();                  /* worker reply rings -> lwIP              */
    net_apply_worker_requests();     /* worker-requested close / Nagle toggles  */
    net_frame_cloud_reply();         /* a finished cloud command -> response    */
    net_eth_apply_request();         /* apply a pending eth stop/start/restart  */

    uint32_t now = HAL_GetTick();
    if (now - link_timer >= 100) {
        link_timer = now;
        /* While the wired link is held down by `eth stop`, skip the link check so
           it stays down until an explicit `eth start` (the check would otherwise
           re-up it as soon as the PHY reports link). */
        if (!s_eth_admin_down) ethernet_link_check_state(&s_eth.netif);
        update_default_route();
    }
    if (!s_eth_admin_down) eth_diag_poll(&s_eth.netif, now);
    if (!s_eth_admin_down && now - s_eth.dhcp_timer >= 500) { s_eth.dhcp_timer  = now; dhcp_process(&s_eth);  }
    if (!s_wifi_static && now - s_wifi.dhcp_timer >= 500) { s_wifi.dhcp_timer = now; dhcp_process(&s_wifi); }
}

/* Bring-up diagnostic: pin a static IP on the Wi-Fi netif (disables DHCP on it)
   so a peer can ping the pod — a definitive test of whether the esp-hosted bridge
   delivers UNICAST-to-STA frames to this host. `mask`/`gw` dotted-quad. */
void net_wifi_static(const char *ip_s, const char *mask_s, const char *gw_s)
{
    ip4_addr_t ip, mask, gw;
    if (!ip4addr_aton(ip_s, &ip) || !ip4addr_aton(mask_s, &mask) || !ip4addr_aton(gw_s, &gw)) {
        printf("[net] wifi-static: bad address\r\n");
        return;
    }
    dhcp_stop(&s_wifi.netif);
    netif_set_addr(&s_wifi.netif, &ip, &mask, &gw);
    netif_set_up(&s_wifi.netif);
    netif_set_link_up(&s_wifi.netif);
    strncpy(s_wifi.ip, ip4addr_ntoa(&ip), sizeof(s_wifi.ip) - 1);
    s_wifi.dhcp.state = NET_DHCP_DONE;
    s_wifi_static = true;
    printf("[net] wifi static ip=%s gw=%s (DHCP off on wifi — ping to test unicast RX)\r\n",
           s_wifi.ip, gw_s);
}

const char *net_ip_str(void) { return wifi_get_ip(); }

/* Wired MAC as "aa:bb:cc:dd:ee:ff" (set by ethernetif_init). Returned in a
   static buffer — single-threaded console/command use only. */
const char *net_mac_str(void)
{
    static char buf[18];
    const uint8_t *m = s_eth.netif.hwaddr;
    snprintf(buf, sizeof(buf), "%02x:%02x:%02x:%02x:%02x:%02x",
             m[0], m[1], m[2], m[3], m[4], m[5]);
    return buf;
}
